<!DOCTYPE html>
<html lang="no" prefix="og: http://ogp.me/ns#">
<head>
<title>Fordeler med Emacs</title>
<meta content="text/html; charset=utf-8" http-equiv="Content-Type">
<meta content="no-referrer" name="referrer">
<meta content="noindex" name="robots">
<meta content="Vegard &#216;ye" name="author">
<meta content="2007-11-26" name="date">
<meta content="b34e1dfac14e1db3e15533ef9ebf4db8" name="md5">
<meta content="text/css" http-equiv="Content-Style-Type">
<meta content="width=device-width, initial-scale=1" name="viewport">
<meta content="Fordeler med Emacs" name="DC.Title">
<meta content="Vegard &#216;ye" name="DC.Creator">
<meta content="2007-11-26" name="DC.Date">
<meta content="no" name="DC.Language">
<meta content="text/html" name="DC.Format">
<meta content="Fordeler med Emacs" property="og:title">
<meta content="no" name="og:locale">
<meta content="article" property="og:type">
<meta content="https://epsil.github.io/blog/2007/11/26/" property="og:url">
<meta content="Vegards blogg" property="og:site_name">
<meta content="summary" name="twitter:card">
<meta content="@github" name="twitter:site">
<meta content="Fordeler med Emacs" name="twitter:title">
<link href="../../../../favicon.ico" rel="icon" type="image/x-icon">
<link href="../../../../apple-touch-icon.png" rel="apple-touch-icon">
<link href="../../../../_assets/css/wiki.css" rel="stylesheet">
<link href="index.md" rel="alternate" title="Markdown" type="text/markdown">
<script src="../../../../_assets/js/wiki.js">
</script>
</head>
<body>
<nav class="navbar navbar-default navbar-fixed-top">
<div class="container-fluid topbar">
<ul class="nav nav-pills navbar-left">
<li role="presentation"><a href="../../../../" title="G&#229; hjem"><i class="fa fa-home"></i></a>
</li>
</ul>

<ul class="nav nav-pills navbar-right">
<li role="presentation"><a href="../../../../tmp/clipboard/" target="_blank" title="Kopier til Markdown"><span class="clipboard-logo"></span></a>
</li>

<li role="presentation"><a href="https://github.com/epsil/epsil.github.io/blob/master/blog/2007/11/26/index.md" target="_blank" title="Vis p&#229; GitHub"><i class="fa fa-github"></i></a>
</li>

<li role="presentation"><a href="https://github.com/epsil/epsil.github.io/edit/master/blog/2007/11/26/index.md" target="_blank" title="Rediger p&#229; GitHub"><i class="fa fa-edit"></i></a>
</li>

<li role="presentation"><a href="https://github.com/epsil/epsil.github.io/raw/master/blog/2007/11/26/index.md" target="_blank" title="Vis Markdown-kilde" type="text/plain"><span class="markdown-mark"></span></a>
</li>

<li role="presentation"><a data-toggle="collapse" href="#toc" id="toc-button" title="Innhold"><i class="fa fa-list"></i></a>
</li>
</ul>

<form action="https://www.google.com/search" class="navbar-form" method="get" target="_blank">
<div class="form-group" style="display: inline;">
<div class="input-group" style="display: table;"><span class="input-group-addon" style="width: 1%;"><span class="glyphicon glyphicon-search"></span></span> <input accesskey="." autocomplete="off" class="form-control" name="q" title="S&#248;k" type="text"></div>
</div>
</form>
</div>

<div class="collapse" id="toc">
<ul>
<li><a href="#markering-av-tekst" title="Markering av tekst">Markering av tekst</a>
</li>

<li><a href="#klippe-ut-og-lime-inn-tekst" title="Klippe ut og lime inn tekst">Klippe ut og lime inn tekst</a>
</li>

<li><a href="#automatisk-innrykk" title="Automatisk innrykk">Automatisk innrykk</a>
</li>

<li><a href="#sok-og-erstatt" title="S&#248;k og erstatt">S&#248;k og erstatt</a>
</li>

<li><a href="#apning-av-filer" title="&#197;pning av filer">&#197;pning av filer</a>
</li>

<li><a href="#vindushandtering" title="Vindush&#229;ndtering">Vindush&#229;ndtering</a>
</li>
</ul>
</div>
</nav>

<article class="h-entry" id="main">
<header>
<h1 class="p-name"><a class="u-uid u-url" href="https://epsil.github.io/blog/2007/11/26/" rel="bookmark" target="_blank" title="Permalink">Fordeler med Emacs</a>
</h1>

<p class="author"><a class="p-author h-card" href="https://epsil.github.io/" target="_blank" title="Open epsil.github.io in a new window">Vegard &#216;ye</a> &#8226; <time class="dt-published" datetime="2007-11-26">2007-11-26</time></p>
</header>

<section class="e-content sidenotes">
<section>
<blockquote>
<p>&#8230; It&#8217;s not a negligible feature either. As a professional novelist and occasional desktop publisher it&#8217;s the first thing I looked for after I&#8217;d torn off the shrink wrap, and when I discovered it wasn&#8217;t there, I cursed and swore, went out for a sullen lunch and shouted at the barman.</p>

<p><span class="dquo">&#8220;</span>Something wrong, sir?&#8221; he said. &#8220;Oh, nothing,&#8221; I said gloomily. &#8220;It&#8217;s just the new version of Microsoft Word.&#8221;</p>
</blockquote>

<p>Det ovenst&#229;ende sitatet er fra <a href="http://www.csd.uwo.ca/%7Emagi/personal/humour/Computer_Audience/Douglas%20Adams%27%20Guide%20to%20the%20Macintosh.html" target="_blank" title="Open csd.uwo.ca in a new window">Douglas Adams&#8217; Guide to the Macintosh</a>, som omhandler noe som er typisk for alle programmer vi bruker mye: avhengighet av visse former for funksjonalitet. Jo mer erfaring vi f&#229;r med programmet vi bruker, jo flere snarveier og &#171;triks&#187; l&#230;rer vi oss for &#229; bruke det mer effektivt. Adams&#8217; tekst omhandler tekstbehandlingsprogrammer (slik som Word, OpenOffice Writer og AbiWord), men situasjonen er s&#229; &#229; si den samme for rene teksteditorer (slik som TextMate, Notepad++ og Emacs). Den eneste store forskjellen er kanskje at vi som brukere av teksteditorer gj&#248;r oss avhengige av enda flere snarveier og finesser enn brukere av tekstbehandlingsprogrammer gj&#248;r.</p>

<p><strong>Hva er det som gj&#248;r en funksjon nyttig og tidbesparende?</strong> D&#233;t er det underliggende sp&#248;rsm&#229;let man b&#248;r reflektere over n&#229;r man f&#248;lger med fra sidelinjen p&#229; enda en &#171;editor-krig&#187;: &#171;Hvordan kan du klare deg uten <em>X</em>?&#187; &#171;Hvordan f&#229;r du gjort noe uten <em>Y</em>?&#187; Hvis <em>X</em> eller <em>Y</em> er s&#229; nyttige som deres brukere vil ha det til, b&#248;r man kanskje begynne &#229; bruke dem selv &#8211; enten ved &#229; bytte til programmet de bruker, eller ved &#229; fors&#248;ke &#229; implementere dem i sitt eget milj&#248;. En editor b&#248;r <em>ikke</em> betraktes som en religion; &#229; f&#248;lge med p&#229; hva andre gj&#248;r, ta l&#230;rdom av gode ideer og <em>hele tiden</em> v&#230;re &#229;pen for bedre m&#229;ter &#229; gj&#248;re tingene p&#229;, er veien til effektiv databehandling &#8211; ikke &#229; grave seg ned i sitt eget milj&#248; i hellig overbevisning om at noe bedre ikke finnes.</p>

<p>Jeg bruker <a href="http://www.gnu.org/software/emacs/" target="_blank" title="Open gnu.org in a new window"><abbr class="acronym" title="GNU's Not Unix"><span class="caps">GNU</span></abbr> Emacs</a>, og vil i det f&#248;lgende fortelle om noen av tingene som gj&#248;r Emacs til mitt favorittprogram &#229; redigere tekstfiler i. Det jeg vil fokusere p&#229;, er de tingene som Emacs etter mitt syn gj&#248;r &#171;helt riktig&#187; og som jeg ikke klarer meg foruten. Imidlertid er det f&#248;lgende <em>ikke</em> ment som et fors&#248;k p&#229; &#229; &#171;konvertere&#187; noen til Emacs. Mitt fokus er p&#229; hva slags <em>funksjoner</em> som kan gj&#248;re <em>tekstredigering</em> mer effektivt, ikke p&#229; hvilke <em>programmer</em> som har disse funksjonene (selv om jeg ogs&#229; nevner dette for &#229; gi folk en mulighet til &#229; pr&#248;ve ut det jeg snakker om &#8211; og der min kunnskap om andre programmer strekker til, nevner jeg flere programmer enn bare Emacs).</p>

<p>Det er dessuten en klar grunn til at jeg aldri kunne ha skrevet et &#230;rlig &#171;konverteringsinnlegg&#187;: Min <span class="code"><code id="emacs-2">.emacs</code></span>, oppstartsfilen til Emacs, har etter hvert blitt lang som et uv&#230;r. Den Emacs jeg bruker, er <em>ikke</em> Emacs slik den kommer &#171;ut av boksen&#187;, men har i stedet massevis av tilpasninger for &#229; bli hva <em>jeg</em> mener er en god editor. Det er i hovedsak to m&#229;ter &#229; tolke dette p&#229;:</p>

<ol>
<li>Siden jeg har gjennomf&#248;rt alle endringene som Xah Lee foresl&#229;r i sin artikkel &#171;<a href="http://xahlee.org/emacs/modernization.html" target="_blank" title="Open xahlee.org in a new window">The Modernization of Emacs</a>&#187;, er editoren jeg bruker &#229; betrakte som en <em>modernisert Emacs</em>. (Emacs er mer enn 20 &#229;r gammel, noe som gir seg utslag <abbr title="blant annet">bl.a.</abbr> i programfilosofien &#8211; b&#229;de p&#229; godt og vondt.)</li>

<li>Det er egentlig ikke <em>Emacs</em> jeg bruker, men i stedet et <em>ideal</em> som jeg <em>n&#230;rmer meg</em> gjennom Emacs.</li>
</ol>

<p>Den siste tolkningen er helt klart den mest interessante i denne sammenheng. Emacs er en utvidbar editor fremfor noen, og det &#229; sette fingeren p&#229; hva som &#171;er&#187; Emacs i noens oppsett er ikke alltid like lett. Min egen Emacs er <abbr title="for eksempel">f.eks.</abbr> sterkt inspirert av TextMate p&#229; noen omr&#229;der. F&#248;lgende m&#229; understrekes: <strong>Ingen editor er perfekt, men enhver skikkelig editor lar seg modifisere.</strong></p>

<p>Nok snakk &#8211; her er hva jeg savner mest n&#229;r jeg pr&#248;ver andre editorer:</p>
</section>

<section id="markering-av-tekst">
<h2><a aria-hidden="true" class="header-anchor" href="#markering-av-tekst" title="Markering av tekst"></a>Markering av tekst<a aria-controls="markering-av-tekst-section" aria-expanded="true" aria-hidden="true" class="collapse-button" data-toggle="collapse" href="#markering-av-tekst-section" role="button"></a><a aria-hidden="true" class="collapse-ellipsis" href="#"></a></h2>

<div class="collapse in" id="markering-av-tekst-section">
<p>&#197; markere tekst er vel den redigeringsoperasjonen som utf&#248;res oftest i en editor. De fleste editorer gj&#248;r dette p&#229; en m&#229;te som jeg synes er helt forferdelig etter &#229; ha blitt kjent med Emacs: Man holder <kbd title="Shift">&#8679;</kbd>-tasten eller venstre musetast nede, og s&#229; bruker man henholdsvis tastaturet eller musen til &#229; bevege mark&#248;ren. Hvis man slipper tasten og beveger mark&#248;ren, blir markeringen borte. Mark&#248;ren utgj&#248;r den ene yttergrensen til det markerte omr&#229;det, mens det stedet man begynte markeringen utgj&#248;r den andre. Hvis man er misforn&#248;yd med dette stedet, m&#229; man lage en ny markering.</p>

<p>For meg har dette opplegget vist seg &#229; v&#230;re en ypperlig kilde til kronisk stresslidelse. Hva gj&#248;r man hvis man har behov for &#229; markere <em>store</em> mengder med tekst? Den kjappeste m&#229;ten er &#229; kombinere <kbd title="Shift">&#8679;</kbd>-tasten og <kbd title="Page Up">PgUp</kbd>- eller <kbd title="Page Down">PgDn</kbd>-tastene. Hvis man jobber med en s&#229; stor fil at ogs&#229; dette g&#229;r rimelig tregt, s&#229; har man ikke noe annet valg enn &#229; sitte der med <kbd title="Shift">&#8679;</kbd>- og <kbd title="Page Up">PgUp</kbd>/<kbd title="Down">&#8595;</kbd>-tasten nede og vente langt og lenge p&#229; at markeringen skal bli ferdig og banne h&#248;ylydt n&#229;r <kbd title="Shift">&#8679;</kbd>-tasten glipper og man m&#229; begynne p&#229; nytt. Hvis man likevel f&#229;r det til, og sannsynligheten for d&#233;t er med noen f&#229; unntak omvendt proporsjonal med st&#248;rrelsen p&#229; markeringen, oppdager man naturligvis at man ikke har <em>begynt</em> markeringen der den skulle begynne, og s&#229; m&#229; alt gj&#248;res p&#229; nytt. Jeg overdriver ikke n&#229;r jeg sier at disse triste erfaringene har forbedret min evne til &#229; sette sammen obsk&#248;niteter til lange og grufulle fraser betraktelig.</p>

<p>I Emacs er det intet behov for &#229; holde hverken <kbd title="Shift">&#8679;</kbd>-tasten eller venstre musetast nede. Det markerte omr&#229;det avgrenses av mark&#248;ren p&#229; den ene siden og et usynlig <em>merke</em> p&#229; den andre, og det f&#248;rste man gj&#248;r n&#229;r man lager en markering, er &#229; trykke <kbd title="Control">Ctrl</kbd> + <kbd>Mellomrom</kbd> for &#229; <em>sette</em> dette merket der mark&#248;ren befinner seg. S&#229; kan man flytte p&#229; mark&#248;ren p&#229; den m&#229;ten det passer en best: Man kan bevege seg fra tegn til tegn, fra ord til ord, fra setning til setning, fra avsnitt til avsnitt eller fra skjermfull til skjermfull. Eller man kan oppgi linjenummeret for &#229; hoppe dit man vil. Eller enda bedre: Man kan <em>s&#248;ke</em> seg frem til det stedet hvor man vil at mark&#248;ren skal befinne seg (se bilde). (Min Emacs er faktisk enda smartere enn dette. Ethvert s&#248;k etablerer et <em>passivt omr&#229;de</em> mellom der mark&#248;ren befant seg da jeg begynte s&#248;ket og der den n&#229; befinner seg som f&#248;lge av s&#248;ket. Dette omr&#229;det kan s&#229; gj&#248;res <em>aktivt</em>, som oppn&#229;r det samme som hvis jeg selv hadde satt merket f&#248;r jeg begynte s&#248;ket.)</p>

<figure><a class="image" href="markering.png" title="View markering.png in full screen"><img alt="" src="markering.png"></a>
</figure>

<p>Dersom jeg er misforn&#248;yd med <em>merkets</em> plassering, er ikke det noe problem: Det er bare &#229; be Emacs om &#229; <em>bytte om</em> plasseringene til merket og mark&#248;ren. Slik kan jeg f&#248;rst flikke p&#229; den ene yttergrensen til det markerte omr&#229;det, og s&#229; den andre yttergrensen, helt til jeg har f&#229;tt ting slik jeg vil. Ogs&#229; <em>musen</em> i Emacs drar nytte av dette opplegget: Man <em>kan</em> holde nede venstre musetast og &#171;dra&#187; musepekeren over teksten for &#229; markere den hvis man foretrekker det, men det er <em>mye</em> mer behagelig &#229; <em>h&#248;yreklikke</em> i teksten, noe som markerer omr&#229;det mellom der mark&#248;ren befant seg og der den n&#229; befinner seg som f&#248;lge av klikkingen. Slik kan det markerte omr&#229;dets yttergrenser bestemmes med noen f&#229; museklikk.</p>
</div>
</section>

<section id="klippe-ut-og-lime-inn-tekst">
<h2><a aria-hidden="true" class="header-anchor" href="#klippe-ut-og-lime-inn-tekst" title="Klippe ut og lime inn tekst"></a>Klippe ut og lime inn tekst<a aria-controls="klippe-ut-og-lime-inn-tekst-section" aria-expanded="true" aria-hidden="true" class="collapse-button" data-toggle="collapse" href="#klippe-ut-og-lime-inn-tekst-section" role="button"></a><a aria-hidden="true" class="collapse-ellipsis" href="#"></a></h2>

<div class="collapse in" id="klippe-ut-og-lime-inn-tekst-section">
<p>N&#229;r man har markert en mengde tekst, er det ofte for &#229; kopiere den eller klippe den ut. Dette er imidlertid ikke den eneste m&#229;ten man kan klippe ut tekst p&#229; i Emacs. En <em>veldig</em> behagelig tastekombinasjon er <kbd title="Control">Ctrl</kbd> + <kbd>K</kbd>, som klipper ut (&#171;kill&#187;) alt som befinner seg mellom mark&#248;ren og slutten av linjen. Ved gjentatt bruk av denne kommandoen kan man &#171;spise opp&#187; en rekke linjer uten &#229; markere dem f&#248;rst. (Jeg har funnet igjen denne funksjonen i TextEdit, Xcode og TextMate p&#229; <abbr title="Macintosh">Mac</abbr> <abbr class="acronym" title="Operating System 10"><span class="caps">OS</span> X</abbr>, men ikke i noen rene Windows-programmer.)</p>

<p>Alt man klipper ut i Emacs, havner i den s&#229;kalte <em>kill ring</em>, som er Emacs&#8217; form for utklippstavle. Ved &#229; trykke <kbd title="Control">Ctrl</kbd> + <kbd>Y</kbd> (eller <kbd title="Control">Ctrl</kbd> + <kbd>V</kbd> om man ikke liker de s&#230;regne tastekombinasjonene til Emacs og har konfigurert den deretter) limes det siste man har klippet ut inn; hvis man s&#229; trykker <kbd title="Alt">Alt</kbd> + <kbd>Y</kbd>, byttes dette ut med det <em>forrige</em> man klippet ut, og s&#229; videre hver gang man trykker <kbd title="Alt">Alt</kbd> + <kbd>Y</kbd>. Slik kan man bla seg gjennom alt man har klippet ut uten &#229; gj&#248;re bruk av noen meny, noe som er meget praktisk og effektivt. (Min Emacs har ogs&#229; en meny som jeg kan velge utklipp fra, men jeg bruker den sjelden.)</p>

<p>Litt skryt av TextMate: Hvis man jobber med innrykket kode i TextMate, vil innlimt tekst <em>automatisk</em> rykkes inn ut fra konteksten, slik at man ikke trenger &#229; gj&#248;re dette selv etterp&#229; for &#229; f&#229; ting til &#229; se pent og oversiktlig ut. Dette er s&#229; tidbesparende at jeg har <a href="http://www.emacswiki.org/cgi-bin/wiki/AutoIndentation" target="_blank" title="Open emacswiki.org in a new window">konfigurert</a> Emacs til &#229; gj&#248;re det samme (og ja, at TextMate gj&#248;r dette &#171;ut av boksen&#187; uten noe behov for konfigurering, gir den et plusspoeng).</p>
</div>
</section>

<section id="automatisk-innrykk">
<h2><a aria-hidden="true" class="header-anchor" href="#automatisk-innrykk" title="Automatisk innrykk"></a>Automatisk innrykk<a aria-controls="automatisk-innrykk-section" aria-expanded="true" aria-hidden="true" class="collapse-button" data-toggle="collapse" href="#automatisk-innrykk-section" role="button"></a><a aria-hidden="true" class="collapse-ellipsis" href="#"></a></h2>

<div class="collapse in" id="automatisk-innrykk-section">
<p>N&#229;r vi er inne p&#229; innrykk: En av de <em>virkelig</em> uunnv&#230;rlige funksjonene til Emacs i programmeringssammenheng er dens automatiske innrykking, og da tenker jeg ikke p&#229; de &#171;forsiktige forslagene&#187; som andre editorer som regel kommer med. Det de fleste editorer gj&#248;r kan beskrives slik: Dersom det siste tegnet p&#229; den gjeldende linjen <abbr title="for eksempel">f.eks.</abbr> er en <span class="code"><code class="cpp" id="n-3">{</code></span> og man trykker <kbd title="Enter">&#8629;</kbd>, vil den neste linjen rykkes inn med en tabulator, to mellomrom eller fire mellomrom ekstra, alt ettersom. Dersom det siste tegnet <em>ikke</em> er et slikt spesialtegn, f&#229;r den neste linjen det samme innrykket som den forrige. Alts&#229;: Innrykket &#171;deles ut&#187; n&#229;r brukeren taster <kbd title="Enter">&#8629;</kbd>.</p>

<p>I og for seg er dette en ressursbesparende og elegant m&#229;te &#229; h&#229;ndtere innrykk p&#229;. Men den har en svakhet: Man kan ikke be linjen om &#229; se p&#229; linjen over seg, som <abbr title="for eksempel">f.eks.</abbr> slutter med en <span class="code"><code class="cpp" id="n-4">{</code></span>, og rykke inn seg selv tilsvarende. Det ekstra innrykket linjen har, fikk den da brukeren tastet <kbd title="Enter">&#8629;</kbd> &#8211; og hvis brukeren gjorde noe annet smart, som &#229; bruke piltastene i stedet, s&#229; f&#229;r ikke linjen riktig innrykk. Det f&#229;r ikke de etterf&#248;lgende linjene heller, siden de &#171;etteraper&#187; hverandre og dermed ender opp med det samme, feilaktige innrykket som den f&#248;rste linjen. Vel, s&#229; lenge man gj&#248;r det editoren &#171;vil&#187; man skal gj&#248;re, alts&#229; trykke <kbd title="Enter">&#8629;</kbd>, g&#229;r ting stort sett greit. Men n&#229;r man begynner &#229; kopiere og lime inn kode, kan problemer oppst&#229;.</p>

<p>Dette er et problem. Det <em>siste</em> i hvert fall jeg vil bruke mye tid p&#229; n&#229;r jeg sitter og koder, er &#229; rette opp i innrykkene til koden. <em>Hvis</em> det blir n&#248;dvendig &#229; ordne innrykket til linjen man befinner seg p&#229;, s&#229; b&#248;r det kunne gj&#248;res med <em>ett</em> enkelt tastetrykk &#8211; <abbr title="det vil si">dvs.</abbr> uten &#229; sette inn det riktige antall tabulatorer eller mellomrom <em>selv</em>.</p>

<p>Emacs har en slik tast: <kbd title="Tab">&#8633;</kbd>. Denne tasten setter <em>ikke</em> inn en tabulator ved mark&#248;ren (selv om man naturligvis kan gj&#248;re d&#233;t hvis man har behov for det), men rykker inn linjen mark&#248;ren befinner seg p&#229; med utgangspunkt i den foreg&#229;ende linjen. Det vil si at dersom man roter til innrykket til linjen man befinner seg p&#229;, kan man trykke <kbd title="Tab">&#8633;</kbd> for &#229; komme tilbake til &#171;riktig&#187; innrykk. Dette <em>kunne</em> ha v&#230;rt katastrofalt dersom brukeren og Emacs hadde ulike meninger om hva som utgj&#248;r &#171;riktig&#187; innrykk, men innrykkingsrutinen i Emacs er <em>gjennomtenkt</em> (og konfigurerbar). Se <abbr title="for eksempel">f.eks.</abbr> p&#229; f&#248;lgende C+&#177;kode:</p>

<div class="pre">
<pre class="language-cpp" id="iffoo-bar-baz-quux-cout-foo-bar-baz-quux">
<code class="language-cpp"><span class="token keyword">if</span><span class="token punctuation">(</span>foo <span class="token operator">==</span> <span class="token string">"bar"</span> <span class="token operator">&amp;&amp;</span>
   baz <span class="token operator">==</span> <span class="token string">"quux"</span><span class="token punctuation">)</span> <span class="token punctuation">{</span>
  cout <span class="token operator">&lt;&lt;</span> <span class="token string">"foo, bar, "</span>
       <span class="token operator">&lt;&lt;</span> <span class="token string">"baz, quux"</span><span class="token punctuation">;</span>
<span class="token punctuation">}</span></code>
</pre>
</div>

<p>Her rykkes innholdet i <span class="code"><code class="cpp" id="if">if</code></span>-setningen inn, og den smarte h&#229;ndteringen av str&#248;moperatoren (<span class="code"><code class="cpp" id="n-5">&lt;&lt;</code></span>) gj&#248;r det uproblematisk &#229; &#171;<span class="code"><code class="cpp" id="cout">cout</code></span>-e&#187; tekst som g&#229;r over mer enn en linje. For &#248;vrig har Emacs ogs&#229; en kommando som ordner innrykket til alle linjene i det markerte omr&#229;det.</p>
</div>
</section>

<section id="sok-og-erstatt">
<h2><a aria-hidden="true" class="header-anchor" href="#sok-og-erstatt" title="S&#248;k og erstatt"></a>S&#248;k og erstatt<a aria-controls="sok-og-erstatt-section" aria-expanded="true" aria-hidden="true" class="collapse-button" data-toggle="collapse" href="#sok-og-erstatt-section" role="button"></a><a aria-hidden="true" class="collapse-ellipsis" href="#"></a></h2>

<div class="collapse in" id="sok-og-erstatt-section">
<p>Emacs har s&#248;k og s&#248;k og erstatt med vanlig tekst, regul&#230;re uttrykk og fra og med versjon 22 <a href="http://steve-yegge.blogspot.com/2006/06/shiny-and-new-emacs-22.html#replace" target="_blank" title="Open steve-yegge.blogspot.com in a new window">regul&#230;re uttrykk med Elisp-kode</a>. Det jeg liker aller best med alt dette er at det <em>ikke legger hindringer i veien din</em>.</p>

<p>De fleste editorer gj&#248;r som nettleseren Opera n&#229;r de s&#248;ker etter tekst: De &#229;pner et dialogvindu med en &#171;S&#248;k&#187;-knapp og et felt hvor s&#248;keteksten skrives inn. Dette vinduet dukker opp midt p&#229; skjermen, s&#229; det dekker over deler av teksten som man sitter og leser. Videre krever det at man <em>f&#248;rst</em> skriver inn s&#248;kestrengen og <em>s&#229;</em> s&#248;ker etter teksten man har skrevet inn, i to operasjoner. Til slutt, n&#229;r man har funnet det man s&#248;ker etter, m&#229; man selv s&#248;rge for &#229; <em>lukke</em> vinduet med s&#248;keteksten i. <em>Argh!</em></p>

<p>Nettleseren Firefox, derimot, utf&#248;rer s&#248;king p&#229; en <em>mye</em> smartere m&#229;te. For det f&#248;rste dukker s&#248;kefeltet opp n&#230;r bunnen av nettleservinduet, ikke i et eget vindu som dekker over deler av teksten. For det andre er s&#248;kefunksjonen i Firefox <em>inkrementell</em>: Man skriver &#171;de&#187;, og Firefox viser automatisk alle forekomster av &#171;de&#187;, med mulighet for &#229; velge mellom dem med <kbd title="Enter">&#8629;</kbd>-tasten; man skriver &#171;t&#187;, og Firefox viser alle forekomster av &#171;det&#187;; man skriver &#171;te&#187;, og Firefox viser alle forekomster av &#171;dette&#187;. For det tredje: Hvis man vil lukke s&#248;ket &#8211; og dette er strengt tatt ikke n&#248;dvendig siden det nesten ikke opptar noen plass p&#229; skjermen &#8211; er det gjort med ett enkelt tastetrykk: <kbd title="Escape">Esc</kbd>.</p>

<p>N&#229;r man har brukt inkrementelt s&#248;k en stund, er det som regel uaktuelt &#229; g&#229; tilbake til &#171;vanlig&#187; s&#248;k. Som &#233;n sa det: &#171;if it isn&#8217;t incremental, it&#8217;s excremental.&#187;</p>

<p>Emacs&#8217; s&#248;kefunksjon er inkrementell, og s&#248;keteksten skrives inn i den lille &#171;kommandolinjen&#187; i bunnen av vinduet som kalles <em>minibufferen</em>. N&#229;r jeg vil gj&#248;re et s&#248;k, trykker jeg <kbd title="Control">Ctrl</kbd> + <kbd>S</kbd>, som flytter mark&#248;ren til minibufferen. S&#229; skriver jeg inn s&#248;keteksten, og som i Firefox vises forekomster av den mens den skrives inn. N&#229;r jeg har skrevet inn hele s&#248;kestrengen, kan jeg trykke <kbd title="Control">Ctrl</kbd> + <kbd>S</kbd> for &#229; velge mellom forekomster av den (<kbd title="Control">Ctrl</kbd> + <kbd>S</kbd> g&#229;r forover og <kbd title="Control">Ctrl</kbd> + <kbd>R</kbd> g&#229;r bakover). N&#229;r jeg har kommet dit jeg vil, trykker jeg <kbd title="Enter">&#8629;</kbd> eller en av piltastene for &#229; hoppe ut av minibufferen. Enkelt og effektivt!</p>

<p>Ogs&#229; s&#248;kingen med regul&#230;re uttrykk er inkrementell; gitt at uttrykket er komplett, vil Emacs vise forekomster av det. S&#248;k og erstatt-operasjoner kan gj&#248;res med eller uten regul&#230;re uttrykk, og ogs&#229; de skrives inn i minibufferen; det er ingen forstyrrende dialogvinduer som dekker over deler av teksten i Emacs. (Det ville trolig v&#230;re &#229; g&#229; for langt &#229; kreve en minibuffer i andre editorer ogs&#229;, men iblant er jeg neimen ikke sikker.) Dersom man har markert et omr&#229;de med tekst f&#248;r en s&#248;k og erstatt-operasjon, vil operasjonen begrense seg til dette omr&#229;det. Man kan erstatte alle treff p&#229; en gang, eller man kan ta dem for seg en av gangen. Man kan ogs&#229; telle antall treff (<abbr title="for eksempel">f.eks.</abbr> er det regul&#230;re uttrykket <span class="code"><code id="w">\w+</code></span> en ordteller).</p>

<p>Og en ting til: Emacs har st&#248;tte for regul&#230;re uttrykk med linjeskift.</p>

<figure><a class="image" href="erstatt.png" title="View erstatt.png in full screen"><img alt="" src="erstatt.png"></a>
</figure>
</div>
</section>

<section id="apning-av-filer">
<h2><a aria-hidden="true" class="header-anchor" href="#apning-av-filer" title="&#197;pning av filer"></a>&#197;pning av filer<a aria-controls="apning-av-filer-section" aria-expanded="true" aria-hidden="true" class="collapse-button" data-toggle="collapse" href="#apning-av-filer-section" role="button"></a><a aria-hidden="true" class="collapse-ellipsis" href="#"></a></h2>

<div class="collapse in" id="apning-av-filer-section">
<p>Jeg har den filosofien at operasjoner som utf&#248;res ofte, b&#248;r kunne utf&#248;res p&#229; flere m&#229;ter, slik at man kan velge den m&#229;ten som er mest passende etter situasjonen. Noen ganger passer det best &#229; &#229;pne filer med et visuelt grensesnitt, andre ganger vil man bare taste inn banen direkte. Emacs st&#248;tter begge deler.</p>

<p>Problemet med den visuelle m&#229;ten &#229; &#229;pne filer p&#229; er at n&#229;r den kommer til kort, s&#229; kommer den virkelig til kort ogs&#229;. Hva gj&#248;r man n&#229;r filen er en av <em>mange</em> filer i samme katalog? Vel, hvis filnavnet begynner p&#229; <em>e</em>, s&#229; kan man trykke <kbd>E</kbd> p&#229; tastaturet for &#229; hoppe til den f&#248;rste filen som begynner p&#229; <em>e</em>. Men hvis det er mange slike filer, s&#229; er det likevel n&#248;dvendig med en masse rulling f&#248;r man omsider finner filen man skal ha i den overveldende listen med filnavn. N&#229;r man bare taster inn banen til filen i minibufferen, derimot, har man aldri denne lange listen med filnavn &#229; &#171;kjempe&#187; med &#8211; man bare taster inn filnavnet, og det er det.</p>

<p>Men hva hvis man ikke husker filens n&#248;yaktige plassering eller filnavn? Emacs&#8217; fil&#229;pningsrutine har autofullf&#248;r, bundet til <kbd title="Tab">&#8633;</kbd>. Dermed kan man skrive inn den f&#248;rste delen av filnavnet (eller plasseringen) og trykke <kbd title="Tab">&#8633;</kbd> en eller flere ganger for &#229; bla gjennom forslag til fil- eller mappenavn. Dette gj&#248;r inntasting av baner enkelt og effektivt.</p>

<figure><a class="image" href="filer.png" title="View filer.png in full screen"><img alt="" src="filer.png"></a>
</figure>

<p>Min egen Emacs bruker en enda smartere fullf&#248;ringsrutine, vist p&#229; bildet over. Den minner litt om de nye billettautomatene til <abbr class="acronym" title="Norges statsbaner"><span class="caps">NSB</span></abbr>, som viser en liste over forslag til togstasjoner og snevrer inn listen n&#229;r man taster inn mer av stasjonsnavnet. I min Emacs vises en slik liste ved siden av filnavnet, og jeg kan snevre inn listen ved &#229; taste inn en hvilken som helst del av filnavnet. (Jeg kan ogs&#229; bytte mellom filer jeg allerede har &#229;pnet p&#229; dette viset.) Dette gir meg s&#229; &#229; si det beste av begge verdener: rask &#229;pning av filer og et overblikk over katalogen de befinner seg i <em>uten</em> &#229; m&#229;tte rulle en lang liste med filnavn. (TextMate har for &#248;vrig noe av det samme.)</p>

<p>N&#229;r man jobber med mange filer, kan det ogs&#229; v&#230;re kjekt med en oversikt over katalogen man befinner seg i eller filene man har &#229;pnet til h&#248;yre eller venstre for selve redigeringsvinduet. I Emacs f&#229;r man dette med Speedbar (vist til venstre p&#229; bildet).</p>
</div>
</section>

<section id="vindushandtering">
<h2><a aria-hidden="true" class="header-anchor" href="#vindushandtering" title="Vindush&#229;ndtering"></a>Vindush&#229;ndtering<a aria-controls="vindushandtering-section" aria-expanded="true" aria-hidden="true" class="collapse-button" data-toggle="collapse" href="#vindushandtering-section" role="button"></a><a aria-hidden="true" class="collapse-ellipsis" href="#"></a></h2>

<div class="collapse in" id="vindushandtering-section">
<p>Emacs&#8217; m&#229;te &#229; h&#229;ndtere vinduer p&#229; er like effektiv som den er gammel og ved f&#248;rste &#248;yekast <em>stygg</em>: &#201;n ting som nok holder mange fra &#229; umiddelbart omfavne Emacs, er at vinduene rett og slett ser ut som noe fra en terminalmaskin fra 20 &#229;r siden. I stedet for &#229; opprette mindre vinduer som &#171;flyter&#187; rundt inni hovedvinduet, &#171;splitter&#187; Emacs arbeidsomr&#229;det opp i mindre deler ved bruk av rullefelt og statuslinjer. Vinduenes st&#248;rrelse bestemmes ved &#229; flytte p&#229; disse.</p>

<p>Emacs&#8217; vindush&#229;ndtering er like fullt noe av det jeg liker best med Emacs. Hvordan har det seg? Det hele koker ned til et <em>konseptuelt skille</em>: Der andre editorer behandler vinduet og vinduets <em>innhold</em> som &#233;n udelelig enhet, <em>skiller Emacs mellom vinduet og innholdet i vinduet</em>. Innholdet i et vindu kalles i Emacs-terminologi for en <em>buffer</em>. N&#229;r man befinner seg i et hvilket som helst vindu, kan man be vinduet om &#229; bytte buffer &#8211; omtrent slik man kan bytte siden som vises i en nettleser (eller mer presist: i en av nettleserens faner).</p>

<p>Dette betyr at man <em>f&#248;rst</em> kan sette opp de vinduene man har bruk for (<abbr title="for eksempel">f.eks.</abbr> to vinduer under hverandre), og <em>deretter</em> velge hva man vil bruke disse vinduene til &#229; vise. &#197; bytte buffere g&#229;r dessuten s&#229; raskt at man godt kan bruke ett og samme vindu til &#229; veksle mellom to buffere. Alt dette gj&#248;res naturligvis med tastaturet. Selv om de fleste editorer har kommandoer for automatisk oppstilling av vinduer, har jeg til gode &#229; se noe som er like effektivt som Emacs&#8217; vindush&#229;ndtering.</p>

<figure><a class="image" href="vinduer.png" title="View vinduer.png in full screen"><img alt="" src="vinduer.png"></a>
</figure>

<p>P&#229; bildet over opererer jeg med to vinduer: et for programmering og et for kommandolinjen. Det siste er ekstremt praktisk dersom man bruker kommandolinjen mye. Dette illustrerer for &#248;vrig den ber&#248;mte allsidigheten til Emacs: Det aller meste, fra filbehandling til &#229; lese e-post og surfe p&#229; nettet, kan gj&#248;res <em>i</em> Emacs. Onde tunger refererer til denne allsidigheten med de like ber&#248;mte ordene &#171;Emacs is a great <abbr class="acronym" title="operativsystem"><span class="caps">OS</span></abbr>, the only thing it lacks is a decent editor&#187;.</p>

<p>N&#229;r det kommer til stykket, er det <em>tekstredigering</em> alt dette dreier seg om. Jeg har i det ovenst&#229;ende tatt for meg de funksjonene som er mer eller mindre unike for Emacs, men de funksjonene som alle skikkelige editorer har i en eller annen form, fortjener ogs&#229; &#229; nevnes: linjenummere, fargekoding, innsetting og fremheving av parentespar, autofullf&#248;r, forkortelser, kode-folding, tastaturmakroer, rektangul&#230;r redigering (&#171;column mode&#187;), <span class="caps">TAGS</span>-navigering <abbr title="og andre">o.a.</abbr> (Se for &#248;vrig Wikipedias &#171;<a href="http://en.wikipedia.org/wiki/Comparison_of_text_editors" target="_blank" title="Open en.wikipedia.org in a new window">Comparison of text editors</a>&#187;-artikkel.) Uansett hvilken editor man blir kjent med disse funksjonene i, vil de alle fleste v&#230;re enige i at de er <em>uvurderlige</em> n&#229;r det har blitt en vane &#229; bruke dem.</p>

<p>Derfor er i hvert fall min skuffelse stor n&#229;r jeg pr&#248;ver et program spesifikt beregnet p&#229; programmering, et s&#229;kalt <em><abbr class="acronym" title="Integrated Development Environment"><span class="caps">IDE</span></abbr></em> (Integrated Development Environment), og finner at det <em>mangler</em> en eller flere av disse funksjonene. Den konklusjonen jeg har trukket etter &#229; unders&#248;kt mer enn ett av de st&#248;rste <abbr class="acronym" title="Integrated Development Environment"><span class="caps">IDE</span></abbr>-ene, er at mens de alltid gir en veldig god <em>oversikt</em> over koden man jobber med, er ikke vinduet hvor koden skrives inn i <em>n&#230;rheten</em> av &#229; oppfylle de kravene jeg som editor-entusiast stiller. I forundring tenker jeg: Er det virkelig meningen at man skal <em>kode</em> i det der? Og min endelige dom over programmet blir en parafrasering av det ber&#248;mte Emacs-utsagnet: &#171;<abbr class="acronym" title="Integrated Development Environment"><span class="caps">IDE</span></abbr> <em>X</em> is a great <abbr class="acronym" title="Integrated Development Environment"><span class="caps">IDE</span></abbr>, the only thing it lacks is a decent editor.&#187;</p>

<p>Derfor er Emacs&#8217; allsidighet kanskje ikke en s&#229; dum ting allikevel, siden den gj&#248;r det mulig &#229; bruke <a href="http://www.linuxjournal.com/article/5765" target="_blank" title="Open linuxjournal.com in a new window">Emacs som <abbr class="acronym" title="Integrated Development Environment"><span class="caps">IDE</span></abbr></a>.</p>

<blockquote>
<p>He narrowed his eyes apprehensively. &#8220;My God,&#8221; he breathed, &#8220;don&#8217;t say they left out the word count again &#8230; oh, the senselessness of it all!&#8221;</p>
</blockquote>

<p>Og Word? La oss prise oss lykkelige over at det er editorer og ikke tekstbehandlingsprogrammer vi h&#229;ndterer her. I 2007 er Word i sin &#229;ttende &#229;rstallsutgave og har fortsatt ingen intelligent st&#248;tte for <a href="http://grendel.no/no.fag.typografi/gjess.php" target="_blank" title="Open grendel.no in a new window">ordentlige anf&#248;rselstegn</a>, noe det gratis alternativet OpenOffice Writer har hatt i &#229;revis. Uansett hvilket program man velger, b&#248;r man se til at det har et aktivt utviklingsmilj&#248; som bidrar med ny og forbedret funksjonalitet, ikke bare den type kosmetiske endringer som praktisk talt er det eneste som driver mesteparten av Microsofts programvare fremover. P&#229; den m&#229;ten er man sikret at ny funksjonalitet legges til fordi noen har <em>bruk</em> for den, fremfor enda et fors&#248;k p&#229; &#229; skvise mer penger ut av &#171;same shit, different wrapping&#187;. Man vil ogs&#229; befinne seg i en helt annen situasjon dersom man f&#248;ler for &#229; bidra med ny funksjonalitet <em>selv</em>.</p>

<p>Hvis programmet ikke har et aktivt utviklingsmilj&#248;, er man prisgitt opphavsmennenes luner og innfall, og &#229; spekulere i <em>deres</em> intensjoner er aldri s&#230;rlig givende:</p>

<blockquote>
<p>&#8220;Why is there pain and misery in the world?&#8221; I said. &#8220;Why is the sky blue? Why is water wet? Why didn&#8217;t Microsoft even put in a word count? These things are unknowable.&#8221;</p>

<p>&#8220;You, sir, are a philosopher,&#8221; said the barman. &#8220;You have to be in this business,&#8221; I said and left.</p>
</blockquote>
</div>
</section>
</section>
</article>
</body>
</html>
